Revit 2027 API
ParameterTypeId.RebarShapeStartHookOffset Property
 "Start Hook Offset Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeStartHookOffset { get; }
Public Shared ReadOnly Property RebarShapeStartHookOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeStartHookOffset {
	ForgeTypeId^ get ();
}
static member RebarShapeStartHookOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace